# FillPattern Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FillPattern Constructor
FillPattern Class See Also
---
Creates a fill pattern with FillPatternHostOrientation::FPORIENTATION_TO_VIEW and FillPatternTarget::FPTARGET_NONE.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FillPattern()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FillPattern()
```

# See Also
FillPattern Class
FillPattern Overload
Autodesk.Revit.DB Namespace